Revit 2027 API
ParameterTypeId.AnalyticalModelBaseExtensionMethod Property
 "Base Extension Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelBaseExtensionMethod { get; }
Public Shared ReadOnly Property AnalyticalModelBaseExtensionMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelBaseExtensionMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelBaseExtensionMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace